<?php

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class IbBranchesTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        DB::table('ib_branches')->insert([
            [
                'title' => 'การตรวจโรงงานเพื่อการรับรองคุณภาพผลิตภัณฑ์',
            ],
            [
                'title' => 'เครื่องแต่งกาย: เสื้อผ้าสำเร็จรูป',
            ],
            [
                'title' => 'ผลิตภัณฑ์อาหาร: การตรวจผลิตภัณฑ์อาหาร',
            ],
            [
                'title' => 'ยานยนต์: รถยนต์',
            ],
            [
                'title' => 'เครื่องจักรกล: ถังก๊าซปิโตรเลียมเหลว',
            ],
            [
                'title' => 'สินค้าเกษตร',
            ],
            [
                'title' => 'สินค้าเกษตร :  ผลิตภัณฑ์มันสําปะหลัง',
            ],
            [
                'title' => 'สินค้าเทกอง',
            ],
            [
                'title' => 'สิ่งแวดล้อม',
            ],
            [
                'title' => 'การตรวจสถานประกอบการผลิตวัตถุอันตราย (ที่สํานักงานคณะกรรมการอาหารและยารับผิดชอบ)',
            ],
            [
                'title' => 'การตรวจโรงงานเพื่อการรับรองคุณภาพผลิตภัณฑ์',
            ],
            [
                'title' => 'การตรวจสอบวัสดุ ชิ้นส่วน และเครื่องจักรกล และอุปกรณ์ต่างๆ (Shop Inspection)',
            ],
            [
                'title' => 'การตรวจสอบความปลอดภัยของปริมาณรังสี',
            ],
            [
                'title' => 'การตรวจสอบวัสดุ ชิ้นส่วนและเครื่องจักรกลและอุปกรณ์ต่างๆ (Shop inspection)',
            ],
            [
                'title' => 'เครื่องจักรกล: หม้อน้ำและหม้อต้มที่ใช้ของเหลวเป็นสื่อนําความร้อน',
            ],
            [
                'title' => 'การตรวจสอบอุปกรณ์ผลิตภัณฑ์ชิ้นส่วนทางไฟฟ้าและอิเล็กทรอนิกส์',
            ],
            [
                'title' => 'การตรวจสอบแบบไม่ทําลาย (Non-Destructive Testing : NDT)',
            ],
            [
                'title' => 'ชิ้นส่วนทางกลและผลิตภัณฑ์อุตสาหกรรมป้องกันประเทศและยุทโธปกรณ์',
            ],
            [
                'title' => 'วัตถุดิบ',
            ],
            [
                'title' => 'เครื่องจักร',
            ],
            [
                'title' => 'การตรวจสอบระบบไฟฟ้าอุปกรณ์ไฟฟ้าและอิเล็กทรอนิกส์',
            ],
            [
                'title' => 'การตรวจสอบวัสดุ ชิ้นส่วน และเครื่องจักรกลและอุปกรณ์ต่างๆของภาชนะรับความดัน',
            ],
            [
                'title' => 'การตรวจพิสูจน์ลายนิ้วมือ ฝ่ามือ และฝ่าเท้าแฝง',
            ],
            [
                'title' => 'การตรวจพิสูจน์พยานเอกสารและการปลอมแปลง',
            ],
            [
                'title' => 'การตรวจพิสูจน์อาวุธปืนและเครื่องกระสุน',
            ],
            [
                'title' => 'การตรวจสถานที่เกิดเหตุ',
            ],
            [
                'title' => 'การตรวจลายนิ้วมือ ฝ่ามือ และฝ่าเท้า',
            ],
            [
                'title' => 'การตรวจอาวุธปืนและเครื่องกระสุนปืน',
            ],
            [
                'title' => 'นิติวิทยาศาสตร์: การตรวจสถานที่เกิดเหตุ',
            ],
            [
                'title' => 'การตรวจพิสูจน์เอกสารและการปลอมแปลง',
            ],
            [
                'title' => 'การตรวจสอบวัสดุ ชิ้นส่วน เครื่องจักรกล และอุปกรณ์ต่าง ๆ สําหรับ ระบบท่อและอุปกรณ์ที่เกี่ยวข้อง',
            ],
            [
                'title' => 'การตรวจสอบอุปกรณ์ไฟฟ้าเครื่องมือวัดทางไฟฟ้าต่าง ๆ เช่นหม้อแปลงไฟฟ้า เครื่องกําเนิดไฟฟ้า รางเคเบิล ตู้ควบคุมไฟฟ้า',
            ],
            [
                'title' => 'การตรวจสอบวัสดุ ชิ้นส่วนเครื่องจักรกล และอุปกรณ์ต่าง ๆ สําหรับ อุปกรณ์ความดัน',
            ],
            [
                'title' => 'การตรวจสอบวัสดุ ชิ้นส่วนและเครื่องจักรกล และอุปกรณ์ต่างๆ (Shop Inspection)',
            ],
            [
                'title' => 'การตรวจควบคุมชิ้นส่วนผลิตภัณฑ์และระบบที่เกี่ยวกับยานยนต์',
            ],
            [
                'title' => 'การตรวจสอบโดยไม่ทําลาย (Non-Destructive Testing : NDT)',
            ],
            [
                'title' => 'การตรวจสอบโดยไม่ทําลาย (Non-Destructive Testing : NDT) และงานตรวจสอบตามกฎหมาย ตามประกาศกรมธุรกิจพลังงาน',
            ],

        ]);
    }
}
